---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseC
source: html/f5054a72-4c1f-1a49-1bb4-2b0b739c99f4.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseC Property

The ApparentCurrentPhaseC value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentCurrentPhaseC { get; }
```

## Remarks
This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!